app/controllers/calendars_controller.rb

  def create
    @plan = Plan.new(plan_params)
    if @plan.save
---
INSERT INTO `plans` (`plan`, `date`, `created_at`, `updated_at`) VALUES ('出かける', '2025-03-26', '2025-03-20 03:47:12.066114', '2025-03-20 03:47:12.066114')

  def getWeek
    wdays = ['(日)','(月)','(火)','(水)','(木)','(金)','(土)']

    # Dateオブジェクトは、日付を保持しています。下記のように`.today.day`とすると、今日の日付を取得できます。
    @todays_date = Date.today
    # 例)　今日が2月1日の場合・・・ Date.today.day => 1日

    @week_days = []

    plans = Plan.where(date: @todays_date..@todays_date + 6)

    7.times do |x|
      today_plans = []
      plans.each do |plan|
---
SELECT `plans`.* FROM `plans` WHERE `plans`.`date` BETWEEN '2025-03-16' AND '2025-03-22'
SELECT `plans`.* FROM `plans` WHERE `plans`.`date` BETWEEN '2025-03-20' AND '2025-03-26'